In [1]:
import pandas as pd
from scipy.stats import f
from scipy.stats import bartlett
from scipy.stats import levene

In [2]:
df=pd.read_csv("financial_info_10k_persons.csv")
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65

In [3]:
ser_M = df.loc[df["Gender"]=="M","Period_m"]
ser_F = df.loc[df["Gender"]=="F","Period_m"]

In [4]:
F=ser_M.var()/ser_F.var() #F검정
F

1.040426345317289

In [5]:
result=f.cdf(F,dfd=len(ser_M)-1,dfn=len(ser_F)) #cdf 자유도
result

0.9187893064992898

In [6]:
p=(1-result)*2 #P-value
p

0.1624213870014204

In [8]:
bartlett(ser_F,ser_M) #bartlett 검정

BartlettResult(statistic=1.9563015878266161, pvalue=0.16190940989253869)

In [12]:
stat,p=bartlett(ser_F,ser_M)
print(round(stat,3))
print(round(p,3))

1.956
0.162

In [13]:
levene(ser_F,ser_M)

LeveneResult(statistic=2.4640198991740747, pvalue=0.11651198398605053)

In [14]:
stat,p=levene(ser_F,ser_M)
print(round(stat,3))
print(round(p,3))

2.464
0.117

#1번 문제

In [15]:
df=pd.read_csv("financial_info_10k_persons.csv")
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65

In [17]:
df["trans_1_mean"]=df["Total_trans_amt"]/df["Total_trans_cnt"] #1회 평균변수 만들기
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt,trans_1_mean
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67,62.432836
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65,63.707692

In [19]:
samp_m=df.loc[df["Gender"]=="M","trans_1_mean"] #남성 1회평균
samp_f=df.loc[df["Gender"]=="F","trans_1_mean"] #여성 1회 평균
F=samp_m.var()/samp_f.var() # 남성 여성 분산 F검정 함수
print(F)

1.6665446172570928

In [24]:
df["Age_g"]=(df["Age"]//10)*10 #10살 단위로 나이변수 묶기
df.head()

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt,trans_1_mean,Age_g
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67,62.432836,40
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65,63.707692,30
2,3,0,57,F,2,Uneducated,Single,$40K - $60K,Silver,36,6,3,0,19482.0,1421,22,64.590909,50
3,4,0,57,F,2,Doctorate,Single,Less than $40K,Blue,44,2,2,3,9149.0,14401,100,144.010000,50
4,5,0,63,F,1,Uneducated,Single,Unknown,Blue,55,4,3,1,16312.0,4366,68,64.205882,60

In [23]:
bartlett(df.loc[df["Age_g"]==50,"trans_1_mean"], #50,60,70대 1회 평균 비교
        df.loc[df["Age_g"]==60,"trans_1_mean"],
        df.loc[df["Age_g"]==70,"trans_1_mean"])

BartlettResult(statistic=10.989031521671865, pvalue=0.004109245841612487)

3번

In [27]:
df=pd.read_csv("financial_info_10k_persons.csv")
df["trans_1_mean"]=df["Total_trans_amt"]/df["Total_trans_cnt"]
df_sub=df.loc[(df["Dependent_cnt"]==0)&(df["Gender"]=="M"),] #부양가족이 없고 남성을 동시에 만족하는 변수
df_sub.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt,trans_1_mean
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65,63.707692
26,27,0,32,M,0,College,Unknown,Less than $40K,Blue,36,3,3,4,3788.0,3975,65,61.153846

In [29]:
len(df_sub) #row 개수

413

In [30]:
df_sub["Edu_level"].unique() #교육 수준 종류

array(['High School', 'College', 'Unknown', 'Graduate', 'Uneducated',
       'Doctorate', 'Post-Graduate'], dtype=object)

In [31]:
df_sub["Edu_level"].unique()[6] #6번째 추출가능 이것을 이용

'Post-Graduate'

In [32]:
levene(df_sub.loc[df_sub["Edu_level"]==df_sub["Edu_level"].unique()[0],"trans_1_mean"],
      df_sub.loc[df_sub["Edu_level"]==df_sub["Edu_level"].unique()[1],"trans_1_mean"],
      df_sub.loc[df_sub["Edu_level"]==df_sub["Edu_level"].unique()[2],"trans_1_mean"],
      df_sub.loc[df_sub["Edu_level"]==df_sub["Edu_level"].unique()[3],"trans_1_mean"],
      df_sub.loc[df_sub["Edu_level"]==df_sub["Edu_level"].unique()[4],"trans_1_mean"],
      df_sub.loc[df_sub["Edu_level"]==df_sub["Edu_level"].unique()[5],"trans_1_mean"],
       df_sub.loc[df_sub["Edu_level"]==df_sub["Edu_level"].unique()[6],"trans_1_mean"])

LeveneResult(statistic=0.8832361640792544, pvalue=0.5070685402777693)